johnm545/Arduino/libraries/ESP8266WiFi/src/WiFiClientSecureBearSSL.cpp
bool WiFiClientSecure::_clientConnected() {
  return (_client && _client->state() == ESTABLISHED);
}

uint8_t WiFiClientSecure::connected() {
  if (available() || (_clientConnected() && _handshake_done && (br_ssl_engine_current_state(_eng) != BR_SSL_CLOSED))) {
    return true;
  }
  return false;
}

/* 
   If there is input record data in the WiFiClient available to be processed, and brssl can accept it, then do it
   This may or may not generate app data, depending on whether a full record can be assembled
   Sometimes more data can be accepted after processing some record data, hence the loop
*/
size_t WiFiClientSecure::_readRecordData() {
  size_t bytesRead = 0;
  
  while (WiFiClient::available() && (br_ssl_engine_current_state(_eng) & BR_SSL_RECVREC)) {
    unsigned char *buf;
    size_t len;
    
    buf = br_ssl_engine_recvrec_buf(_eng, &len);
    //Serial.print("_readRecordData: len "); Serial.println(len);
    int rlen = WiFiClient::read(buf, len); // read is non-blocking, will only read what is available
    //Serial.print("_readRecordData: rlen "); Serial.println(rlen);
    if (rlen <= 0) {
      DEBUG_BSSL("unexpected WiFiClient read fail"); // should not happen...
      break;
    }
    if (rlen > 0) {
      bytesRead += rlen;
      // prompt bearssl to chew on the record data
      br_ssl_engine_recvrec_ack(_eng, rlen);
    }
  }
  return bytesRead;
}

/* 
   If there is record data from the bearssl engine to be sent, and the WiFiClient can accept it, then do it
   This returns the number of bytes written to the WiFiClient tx buffer - they may not have yet gone to air
   
*/
size_t WiFiClientSecure::_writeRecordData(bool blocking) {
  if ((br_ssl_engine_current_state(_eng) & BR_SSL_SENDREC) == false) {
    return 0;
  }
  unsigned char *buf;
  size_t len;
  size_t wlen;

  buf = br_ssl_engine_sendrec_buf(_eng, &len);
  size_t availForWrite = WiFiClient::availableForWrite();
  
  // if we try to write more than availForWrite, the write will block for up to its timeout (default 5sec)
  if (!blocking && len > availForWrite) { 
    len = availForWrite; 
  } 
  wlen = WiFiClient::write(buf, len); // returns a size_t, it can never be < 0
  if (!wlen) DEBUG_BSSL("can't write to WiFiClient\n");
  if (!availForWrite) DEBUG_BSSL("WiFiClient tx buffer is full\n");
  
  if (wlen) {
    br_ssl_engine_sendrec_ack(_eng, wlen);
  }
  return wlen;
}

// note that this returns bytes written to BearSSL sendapp buffer, *not* bytes written to WiFiClient
size_t WiFiClientSecure::_write(const uint8_t *buf, size_t size, bool pmem) {
  size_t sent_bytes = 0;

  if (!connected() || !size || !_handshake_done) {
    return 0;
  }

  do {
    // Ensure we yield if we need multiple fragments to avoid WDT
    if (sent_bytes) {
      optimistic_yield(1000);
    }

    if (br_ssl_engine_current_state(_eng) & BR_SSL_SENDAPP) {
      size_t sendapp_len;
      unsigned char *sendapp_buf = br_ssl_engine_sendapp_buf(_eng, &sendapp_len);
      int to_send = size > sendapp_len ? sendapp_len : size;
      if (pmem) {
        memcpy_P(sendapp_buf, buf, to_send);
      } else {
        memcpy(sendapp_buf, buf, to_send);
      }
      br_ssl_engine_sendapp_ack(_eng, to_send);
      br_ssl_engine_flush(_eng, 0); // force the engine to assemble a record
      (void) _writeRecordData(false); // don't block here, because we may have multiple chunks to send
      (void) flush(0); // wait for some data to go to air, 0 = apply default WiFiClient timeout (300ms)
      buf += to_send;
      sent_bytes += to_send;
      size -= to_send;
    } else {
      // the engine can not accept plaintext input, usually because unsent writes have filled sendapp buffer
      DEBUG_BSSL("_write: sendapp not available\n");
      break;
    }
  } while (size);
  
  // if there is any unsent record data, make a blocking attempt to send it (default 5sec)
  (void) _writeRecordData(true); 
  
  return sent_bytes;
}

size_t WiFiClientSecure::write(const uint8_t *buf, size_t size) {
  return _write(buf, size, false);
}

size_t WiFiClientSecure::write_P(PGM_P buf, size_t size) {
  return _write((const uint8_t *)buf, size, true);
}

// We have to manually read and send individual chunks.
size_t WiFiClientSecure::write(Stream& stream) {
  size_t totalSent = 0;
  size_t countRead;
  size_t countSent;

  if (!connected() || !_handshake_done) {
    DEBUG_BSSL("write: Connect/handshake not completed yet\n");
    return 0;
  }

  do {
    uint8_t temp[256]; // Temporary chunk size same as ClientContext
    countSent = 0;
    countRead = stream.readBytes(temp, sizeof(temp));
    if (countRead) {
      countSent = _write((const uint8_t*)temp, countRead, true);
      totalSent += countSent;
    }
    yield(); // Feed the WDT
  } while ((countSent == countRead) && (countSent > 0));
  return totalSent;
}

int WiFiClientSecure::read(uint8_t *buf, size_t size) {
  if (!ctx_present() || !_handshake_done) {
    return -1;
  }

  int avail = available();
  bool conn = connected();
  if (!avail && conn) {
    return 0;  // We're still connected, but nothing to read
  }
  if (!avail && !conn) {
    DEBUG_BSSL("read: Not connected, none left available\n");
    return -1;
  }

  if (avail) {
    // Take data from the recvapp buffer
    size_t recvapp_len;
    unsigned char *recvapp_buf;
    recvapp_buf = br_ssl_engine_recvapp_buf(_eng, &recvapp_len);
    
    int to_copy = recvapp_len < size ? recvapp_len : size;
    memcpy(buf, recvapp_buf, to_copy);
    br_ssl_engine_recvapp_ack(_eng, to_copy);

    return to_copy;
  }

  if (!conn) {
    DEBUG_BSSL("read: Not connected\n");
    return -1;
  }
  return 0; // If we're connected, no error but no read.
}

int WiFiClientSecure::read() {
  uint8_t c;
  if (1 == read(&c, 1)) {
    return c;
  }
  DEBUG_BSSL("read: failed\n");
  return -1;
}

int WiFiClientSecure::available() {
  optimistic_yield(100); // yield incase called in a busy loop

  if (!ctx_present()) {
    return 0;
  }
  int state = br_ssl_engine_current_state(_eng);
  if (state == BR_SSL_CLOSED) {
    return 0;  // Nothing leftover, SSL is closed
  }
  
